Repository: ministryofjustice/govuk-bank-holidays
Catalog: govuk_bank_holidays/locale/*/LC_MESSAGES/messages.po
Languages: cy

source: Bank holiday
cy: Gŵyl y banc

source: Bank holidays
cy: Gwyliau banc

source: England
cy: Lloegr

source: Wales
cy: Cymru

source: England and Wales
cy: Cymru a Lloegr

source: Scotland
cy: Yr Alban

source: Northern Ireland
cy: Gogledd Iwerddon

source: United Kingdom
cy: Deyrnas Unedig

source: 2nd January
cy: 2 Ionawr

source: Battle of the Boyne (Orangemen’s Day)
cy: Brwydr y Boyne (Diwrnod Orangemen yn)

source: Boxing Day
cy: Gŵyl San Steffan

source: Christmas Day
cy: Dydd Nadolig

source: Early May bank holiday
cy: Mai gŵyl y banc Cynnar

source: Early May bank holiday (VE day)
cy: Mai gŵyl y banc Cynnar (Diwrnod VE)

source: Easter Monday
cy: Llun y Pasg

source: Good Friday
cy: Dydd Gwener y Groglith

source: New Year’s Day
cy: Dydd Calan

source: Queen’s Diamond Jubilee
cy: Jiwbilî Diemwnt y Frenhines

source: Spring bank holiday
cy: Gŵyl y banc y Gwanwyn

source: St Andrew’s Day
cy: Dydd Sant Andreas

source: St Patrick’s Day
cy: Dydd Gŵyl Padrig

source: Summer bank holiday
cy: Gŵyl y banc haf

source: Extra bank holiday
cy: Gŵyl y banc ychwanegol

source: Substitute day
cy: Diwrnod rhodder
